In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
df_left = DataFrame({'key': ['X','Y','Z','X','Y'],
                  'data': range(5)})
df_right = DataFrame({'group_data': [10, 20]}, index=['X', 'Y'])

In [3]:
df_left

   data key
0     0   X
1     1   Y
2     2   Z
3     3   X
4     4   Y

In [4]:
df_right

   group_data
X          10
Y          20

In [5]:
df_left_hr = DataFrame({'key1': ['SF','SF','SF','LA','LA'],
                   'key2': [10, 20, 30, 20, 30],
                   'data_set': np.arange(5.)})
df_right_hr = DataFrame(np.arange(10).reshape((5, 2)),
                   index=[['LA','LA','SF','SF','SF'],
                          [20, 10, 10, 10, 20]],
                   columns=['col_1', 'col_2'])

In [6]:
df_left_hr

   data_set key1  key2
0         0   SF    10
1         1   SF    20
2         2   SF    30
3         3   LA    20
4         4   LA    30

In [7]:
df_right_hr

       col_1  col_2
LA 20      0      1
   10      2      3
SF 10      4      5
   10      6      7
   20      8      9

In [13]:
pd.merge(df_left_hr,df_right_hr,left_on=['key1','key2'],right_index=True)

   data_set key1  key2  col_1  col_2
0         0   SF    10      4      5
0         0   SF    10      6      7
1         1   SF    20      8      9
3         3   LA    20      0      1

In [14]:
#concatenate

In [15]:
arr1 = np.arange(9).reshape(3,3)

In [16]:
np.concatenate([arr1,arr1],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [17]:
np.concatenate([arr1,arr1])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [18]:
ser1 = Series([0,1,3],index=['t','u','v'])

In [20]:
ser2 = Series([3,4],index = ['x','y'])

In [21]:
pd.concat([ser1,ser2])

t    0
u    1
v    3
x    3
y    4
dtype: int64

In [25]:
pd.concat([ser1,ser2],axis=1)

    0   1
t   0 NaN
u   1 NaN
v   3 NaN
x NaN   3
y NaN   4

In [26]:
pd.concat([ser1,ser2],keys=['cat1','cat2'])

cat1  t    0
      u    1
      v    3
cat2  x    3
      y    4
dtype: int64

In [27]:
dframe1 = DataFrame(np.random.randn(4,3), columns=['X', 'Y', 'Z'])
dframe2 = DataFrame(np.random.randn(3, 3), columns=['Y', 'Q', 'X'])

In [31]:
dframe1

          X         Y         Z
0  0.397643  2.163345 -1.204549
1 -0.208157  0.129125  1.101435
2 -0.259028 -1.174031 -0.698583
3  1.888335 -0.792758 -0.239271

In [30]:
dframe2

          Y         Q         X
0  0.687470  0.182560  1.115959
1 -0.832533  0.811599 -0.591767
2  0.650547 -0.581731 -0.312863

In [33]:
pd.concat([dframe1,dframe2])

          Q         X         Y         Z
0       NaN  0.397643  2.163345 -1.204549
1       NaN -0.208157  0.129125  1.101435
2       NaN -0.259028 -1.174031 -0.698583
3       NaN  1.888335 -0.792758 -0.239271
0  0.182560  1.115959  0.687470       NaN
1  0.811599 -0.591767 -0.832533       NaN
2 -0.581731 -0.312863  0.650547       NaN

In [34]:
pd.concat([dframe1,dframe2],ignore_index=True)

          Q         X         Y         Z
0       NaN  0.397643  2.163345 -1.204549
1       NaN -0.208157  0.129125  1.101435
2       NaN -0.259028 -1.174031 -0.698583
3       NaN  1.888335 -0.792758 -0.239271
4  0.182560  1.115959  0.687470       NaN
5  0.811599 -0.591767 -0.832533       NaN
6 -0.581731 -0.312863  0.650547       NaN

In [35]:
#combine data frames

In [36]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan],
           index=['Q','R','S','T','U','V'])

In [37]:
ser1

Q     2
R   NaN
S     4
T   NaN
U     6
V   NaN
dtype: float64

In [38]:
ser1.dtype

dtype('float64')

In [39]:
ser2 = Series(np.arange(len(ser1), dtype=np.float64),
           index=['Q','R','S','T','U','V'])

In [40]:
ser2

Q    0
R    1
S    2
T    3
U    4
V    5
dtype: float64

In [41]:
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

Q    2
R    1
S    4
T    3
U    6
V    5
dtype: float64

In [42]:
ser1.combine_first(ser2)

Q    2
R    1
S    4
T    3
U    6
V    5
dtype: float64

In [43]:
nan = np.nan
dframe_odds = DataFrame({'x':[1.,nan,3.,nan],'y':[nan,5.,nan,7.],'z':[nan,9.,nan,11]})

In [48]:
dframe_evens = DataFrame({'x': [2., 4., np.nan, 6., 8.],
                     'y': [np.nan, 10., 12., 14., 16.]})

In [45]:
dframe_odds

    x   y   z
0   1 NaN NaN
1 NaN   5   9
2   3 NaN NaN
3 NaN   7  11

In [49]:
dframe_evens

    x   y
0   2 NaN
1   4  10
2 NaN  12
3   6  14
4   8  16

In [50]:
dframe_odds.combine_first(dframe_evens)

   x   y   z
0  1 NaN NaN
1  4   5   9
2  3  12 NaN
3  6   7  11
4  8  16 NaN